---
kind: method
id: M:Autodesk.Revit.DB.Architecture.StairsRun.GetFootprintBoundary
source: html/98862b51-f40e-d085-d574-2e6896afdb32.htm
---
# Autodesk.Revit.DB.Architecture.StairsRun.GetFootprintBoundary Method

Returns the run's boundary curves which are projected on the stairs base level.

## Syntax (C#)
```csharp
public CurveLoop GetFootprintBoundary()
```

## Returns
The boundary curves of the stairs run.